dattatraybhairi/vl53l1x_cc2652_prop_rf_rx_tx/rfPacketRx_CC26X2R1_LAUNCHXL_tirtos_ccs/rfPacketRx.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "CC2652R1FRGZ" --package "RGZ" --part "Default" --product "simplelink_cc13x2_26x2_sdk@4.30.00.54"
 * @versions {"data":"2020090214","timestamp":"2020090214","tool":"1.6.0+1543","templates":"2020090214"}
 */

/**
 * Import the modules used in this configuration.
 */
const CCFG     = scripting.addModule("/ti/devices/CCFG");
const custom   = scripting.addModule("/ti/devices/radioconfig/custom");
const rfdesign = scripting.addModule("/ti/devices/radioconfig/rfdesign");
const GPIO     = scripting.addModule("/ti/drivers/GPIO");
const GPIO1    = GPIO.addInstance();
const RF       = scripting.addModule("/ti/drivers/RF");
const RTOS     = scripting.addModule("/ti/drivers/RTOS");

/**
 * Write custom configuration values to the imported modules.
 */
CCFG.enableBootloader         = true;
CCFG.enableBootloaderBackdoor = true;
CCFG.dioBootloaderBackdoor    = 13;
CCFG.levelBootloaderBackdoor  = "Active low";
CCFG.ccfgTemplate.$name       = "ti_devices_CCFGTemplate0";

custom.prop2                                               = ["custom2400"];
custom.radioConfigcustom2400.phyType2400                   = "2gfsk100kbps";
custom.radioConfigcustom2400.$name                         = "RF_Custom_Setting";
custom.radioConfigcustom2400.codeExportConfig.$name        = "ti_devices_radioconfig_code_export_param0";
custom.radioConfigcustom2400.codeExportConfig.symGenMethod = "Legacy";

GPIO1.mode              = "Output";
GPIO1.$name             = "CONFIG_GPIO_RLED";
GPIO1.gpioPin.$assign   = "DIO_28";
GPIO1.pinInstance.$name = "CONFIG_PIN_RLED";
